/*Обчислити суму квадратів всіх парних чисел у діапазоні [1;20].
* з використанням циклу з параметром

*/
#include <stdio.h>//Піключаємо необхідну для роботи бібліотеку

int main() {//Оголошуємо змінну
    int sum = 0;// Змінна для зберігання суми

    for (int i = 2; i <= 20; i += 2) {// Цикл для обчислення квадратів парних чисел
        sum += i * i;// Додавання квадрату поточного числа до суми
    }

    printf("Сума квадратів всіх парних чисел у діапазоні [1;20]: %d\n", sum);//Виведення результату на екран юзера

    return 0;//Кінець програми
}
